Xia730/26-diansai/empty.syscfg
UART3.$name                            = "UART1";
UART3.targetBaudRate                   = 115200;
UART3.enabledInterrupts                = ["RX"];
UART3.peripheral.$assign               = "UART1";
UART3.peripheral.rxPin.$assign         = "PA9";
UART3.peripheral.txPin.$assign         = "PA8";
UART3.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART3.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART3.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART3.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART3.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric11";
UART3.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART3.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART3.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART3.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric19";

UART4.targetBaudRate                   = 115200;
UART4.enabledInterrupts                = ["RX"];
UART4.$name                            = "UART2";
UART4.peripheral.rxPin.$assign         = "PB16";
UART4.peripheral.txPin.$assign         = "PB15";
UART4.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART4.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART4.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART4.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART4.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric0_COPY";
UART4.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART4.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART4.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART4.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric1_COPY";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
pinFunction4.peripheral.$suggestSolution            = "SYSCTL";
pinFunction4.peripheral.hfxInPin.$suggestSolution   = "PA5";
pinFunction4.peripheral.hfxOutPin.$suggestSolution  = "PA6";
Board.peripheral.$suggestSolution                   = "DEBUGSS";
Board.peripheral.swclkPin.$suggestSolution          = "PA20";
Board.peripheral.swdioPin.$suggestSolution          = "PA19";
GPIO5.associatedPins[0].pin.$suggestSolution        = "PA22";
GPIO5.associatedPins[1].pin.$suggestSolution        = "PB24";
GPIO6.associatedPins[0].pin.$suggestSolution        = "PB4";
GPIO6.associatedPins[1].pin.$suggestSolution        = "PB5";
GPIO7.associatedPins[0].pin.$suggestSolution        = "PA15";
GPIO7.associatedPins[1].pin.$suggestSolution        = "PA17";
I2C1.peripheral.$suggestSolution                    = "I2C0";
I2C1.peripheral.sdaPin.$suggestSolution             = "PA28";
I2C1.peripheral.sclPin.$suggestSolution             = "PA31";
PWM1.peripheral.$suggestSolution                    = "TIMG7";
PWM2.peripheral.$suggestSolution                    = "TIMA0";
PWM3.peripheral.$suggestSolution                    = "TIMA1";
PWM3.peripheral.ccp0Pin.$suggestSolution            = "PA10";
PWM3.peripheral.ccp1Pin.$suggestSolution            = "PA11";
SPI1.peripheral.misoPin.$suggestSolution            = "PA16";
SPI1.DMA_CHANNEL_EVENT2.peripheral.$suggestSolution = "DMA_CH0";
UART1.peripheral.$suggestSolution                   = "UART0";
UART4.peripheral.$suggestSolution                   = "UART2";
